List<String> ukrainianNames1 = [
  'Андрій', 'Богдан', 'Віталій', 'Ганна', 'Дарина', 'Єва', 'Жанна', 'Злата', 'Ігор', 'Інна',
  'Катерина', 'Леся', 'Марія', 'Назар', 'Олена', 'Павло', 'Роман', 'Софія', 'Тетяна', 'Уляна',
  'Федір', 'Христина', 'Цезар', 'Чеслав', 'Шевченко', 'Юлія', 'Ярослав', 'Олег', 'Людмила', 'Валентин',
  'Арсен', 'Вікторія', 'Борис', 'Владислав', 'Галина', 'Єгор', 'Женя', 'Зоряна', 'Ілля', 'Ірина',
  'Карина', 'Лілія', 'Максим', 'Наталя', 'Оксана', 'Петро', 'Руслан', 'Світлана', 'Тарас', 'Юрій'
];

List<String> ukrainianNames2 = [
  'Марія', 'Олег', 'Тетяна', 'Інна', 'Ігор', 'Роман', 'Ганна', 'Максим', 'Юлія', 'Оксана',
  'Артур', 'Богдан', 'Святослав', 'Наталя', 'Зоряна', 'Юрій', 'Леся', 'Олена', 'Руслан', 'Софія',
  'Ірина', 'Федір', 'Єгор', 'Жанна', 'Василь', 'Ілля', 'Світлана', 'Лілія', 'Павло', 'Дарина',
  'Катерина', 'Назар', 'Людмила', 'Олексій', 'Злата', 'Тарас', 'Єва', 'Христина', 'Ярослав', 'Борис',
  'Женя', 'Анна', 'Мирослав', 'Григорій', 'Віталій', 'Андрій', 'Карина', 'Петро', 'Арсен', 'Валентин'
];